CSI API ETABS v1
cAnalysisResults.PierForce Method
 Retrieves pier forces for any defined pier objects in the model
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int PierForce(
	ref int NumberResults,
	ref string[] StoryName,
	ref string[] PierName,
	ref string[] LoadCase,
	ref string[] Location,
	ref double[] P,
	ref double[] V2,
	ref double[] V3,
	ref double[] T,
	ref double[] M2,
	ref double[] M3
)
Function PierForce (
	ByRef NumberResults As Integer,
	ByRef StoryName As String(),
	ByRef PierName As String(),
	ByRef LoadCase As String(),
	ByRef Location As String(),
	ByRef P As Double(),
	ByRef V2 As Double(),
	ByRef V3 As Double(),
	ByRef T As Double(),
	ByRef M2 As Double(),
	ByRef M3 As Double()
) As Integer
Dim instance As cAnalysisResults
Dim NumberResults As Integer
Dim StoryName As String()
Dim PierName As String()
Dim LoadCase As String()
Dim Location As String()
Dim P As Double()
Dim V2 As Double()
Dim V3 As Double()
Dim T As Double()
Dim M2 As Double()
Dim M3 As Double()
Dim returnValue As Integer
returnValue = instance.PierForce(NumberResults,
	StoryName, PierName, LoadCase, Location,
	P, V2, V3, T, M2, M3)
int PierForce(
	int% NumberResults,
	array<String^>^% StoryName,
	array<String^>^% PierName,
	array<String^>^% LoadCase,
	array<String^>^% Location,
	array<double>^% P,
	array<double>^% V2,
	array<double>^% V3,
	array<double>^% T,
	array<double>^% M2,
	array<double>^% M3
)
abstract PierForce :
        NumberResults : int byref *
        StoryName : string[] byref *
        PierName : string[] byref *
        LoadCase : string[] byref *
        Location : string[] byref *
        P : float[] byref *
        V2 : float[] byref *
        V3 : float[] byref *
        T : float[] byref *
        M2 : float[] byref *
        M3 : float[] byref -> int
Parameters
NumberResults
Type: System.Int32
 The total number of results returned by the program
StoryName
Type: System.String[]
 The story name of the pier object
PierName
Type: System.String[]
 The name of the pier object
LoadCase
Type: System.String[]
 The names of the load case
Location
Type: System.String[]
 The location on the pier, either "Top" or "Bottom", of the result being reported
P
Type: System.Double[]
 The axial force [F]
V2
Type: System.Double[]
 The shear force in the local 2 direction [F]
V3
Type: System.Double[]
 The shear force in the local 3 direction [F]
T
Type: System.Double[]
 The torsion [FL]
M2
Type: System.Double[]
 The moment about the local 2 axis [FL]
M3
Type: System.Double[]
 The moment about the local 3 axis [FL]
Return Value
Type: Int32
 Returns zero if the results are successfully retrieved; otherwise returns nonzero
Remarks
 See Results for more information.
See Also
Reference
cAnalysisResults Interface
ETABSv1 Namespace